In [1]:
import os

In [7]:
os.getcwd()

os.chdir(r"C:\Users\Seyy_\OneDrive\Desktop\jupyter projects\alex the analyst bootcamp\python")
print(os.getcwd())

C:\Users\Seyy_\OneDrive\Desktop\jupyter projects\alex the analyst bootcamp\python

In [8]:
import pandas as pd

# Employee dataset
data = {
    "employee_id": [101, 102, 103, 104],
    "name": ["Alice Smith", "Bob Johnson", "Carol White", "David Brown"],
    "department": ["Sales", "HR", "IT", "Sales"],
    "hire_date": ["2020-03-15", "2019-07-22", "2021-01-10", "2022-05-30"]
}

employees = pd.DataFrame(data)

In [9]:
employees.to_csv('employees.csv',index=False)

In [10]:
df_check = pd.read_csv('employees.csv')

print(df_check)

   employee_id         name department   hire_date
0          101  Alice Smith      Sales  2020-03-15
1          102  Bob Johnson         HR  2019-07-22
2          103  Carol White         IT  2021-01-10
3          104  David Brown      Sales  2022-05-30

In [11]:
import pandas as pd

salaries = pd.DataFrame({
    "employee_id": [101, 102, 105, 106],
    "base_salary": [55000, 60000, 65000, 70000],
    "bonus": [5000, 4000, 6000, 7000],
    "pay_grade": ["B", "B", "A", "A"]
})

salaries.to_csv("salaries.csv", index=False)

In [12]:
df_salaries = pd.read_csv("salaries.csv")

print(df_salaries)

   employee_id  base_salary  bonus pay_grade
0          101        55000   5000         B
1          102        60000   4000         B
2          105        65000   6000         A
3          106        70000   7000         A

In [35]:
import os

In [36]:
os.getcwd()

'C:\\Users\\Seyy_\\OneDrive\\Desktop\\jupyter projects\\alex the analyst bootcamp\\python'

In [37]:
os.chdir(r'C:\Users\Seyy_\OneDrive\Desktop\jupyter projects\alex the analyst bootcamp\python')
print(os.getcwd())

C:\Users\Seyy_\OneDrive\Desktop\jupyter projects\alex the analyst bootcamp\python

# Merge Func()

In [38]:
import pandas as pd

In [40]:
df1 = pd.read_csv(r"C:\Users\Seyy_\OneDrive\Desktop\jupyter projects\alex the analyst bootcamp\python\employees.csv")
df1

   employee_id         name department   hire_date
0          101  Alice Smith      Sales  2020-03-15
1          102  Bob Johnson         HR  2019-07-22
2          103  Carol White         IT  2021-01-10
3          104  David Brown      Sales  2022-05-30

In [41]:
df2 = pd.read_csv(r"C:\Users\Seyy_\OneDrive\Desktop\jupyter projects\alex the analyst bootcamp\python\salaries.csv")
df2

   employee_id  base_salary  bonus pay_grade
0          101        55000   5000         B
1          102        60000   4000         B
2          105        65000   6000         A
3          106        70000   7000         A

In [44]:
#using .merge()

df1.merge(df2)

,employee_id,name,department,hire_date,base_salary,bonus,pay_grade
0,101,Alice Smith,Sales,2020-03-15,55000,5000,B
1,102,Bob Johnson,HR,2019-07-22,60000,4000,B

In [43]:
pd.merge(df1, df2, on='employee_id')

,employee_id,name,department,hire_date,base_salary,bonus,pay_grade
0,101,Alice Smith,Sales,2020-03-15,55000,5000,B
1,102,Bob Johnson,HR,2019-07-22,60000,4000,B

In [ ]:
#specifying the specific merge, we use Inner  Merger how ='' , on =''

In [47]:
pd.merge(df1, df2, how = 'inner', on='employee_id')

,employee_id,name,department,hire_date,base_salary,bonus,pay_grade
0,101,Alice Smith,Sales,2020-03-15,55000,5000,B
1,102,Bob Johnson,HR,2019-07-22,60000,4000,B

In [ ]:
#Outer Join

In [48]:
pd.merge(df1, df2, how = 'outer', on='employee_id')

,employee_id,name,department,hire_date,base_salary,bonus,pay_grade
0,101,Alice Smith,Sales,2020-03-15,55000.0,5000.0,B
1,102,Bob Johnson,HR,2019-07-22,60000.0,4000.0,B
2,103,Carol White,IT,2021-01-10,NaN,NaN,NaN
3,104,David Brown,Sales,2022-05-30,NaN,NaN,NaN
4,105,NaN,NaN,NaN,65000.0,6000.0,A
5,106,NaN,NaN,NaN,70000.0,7000.0,A

In [ ]:
#Lefter Merge

In [49]:
pd.merge(df1, df2, how = 'left', on='employee_id')

,employee_id,name,department,hire_date,base_salary,bonus,pay_grade
0,101,Alice Smith,Sales,2020-03-15,55000.0,5000.0,B
1,102,Bob Johnson,HR,2019-07-22,60000.0,4000.0,B
2,103,Carol White,IT,2021-01-10,NaN,NaN,NaN
3,104,David Brown,Sales,2022-05-30,NaN,NaN,NaN

In [50]:
#Right Marge

In [51]:
pd.merge(df1, df2, how = 'right', on='employee_id')

,employee_id,name,department,hire_date,base_salary,bonus,pay_grade
0,101,Alice Smith,Sales,2020-03-15,55000,5000,B
1,102,Bob Johnson,HR,2019-07-22,60000,4000,B
2,105,NaN,NaN,NaN,65000,6000,A
3,106,NaN,NaN,NaN,70000,7000,A

In [ ]:
#Cross Merge,
#=> compares values from the left with each value the right on at a time

In [53]:
pd.merge(df1, df2, how = 'cross')

,employee_id_x,name,department,hire_date,employee_id_y,base_salary,bonus,pay_grade
0,101,Alice Smith,Sales,2020-03-15,101,55000,5000,B
1,101,Alice Smith,Sales,2020-03-15,102,60000,4000,B
2,101,Alice Smith,Sales,2020-03-15,105,65000,6000,A
3,101,Alice Smith,Sales,2020-03-15,106,70000,7000,A
4,102,Bob Johnson,HR,2019-07-22,101,55000,5000,B
5,102,Bob Johnson,HR,2019-07-22,102,60000,4000,B
6,102,Bob Johnson,HR,2019-07-22,105,65000,6000,A
7,102,Bob Johnson,HR,2019-07-22,106,70000,7000,A
8,103,Carol White,IT,2021-01-10,101,55000,5000,B
9,103,Carol White,IT,2021-01-10,102,60000,4000,B
10,103,Carol White,IT,2021-01-10,105,65000,6000,A
11,103,Carol White,IT,2021-01-10,106,70000,7000,A
12,104,David Brown,Sales,2022-05-30,101,55000,5000,B
13,104,David Brown,Sales,2022-05-30,102,60000,4000,B
14,104,David Brown,Sales,2022-05-30,105,65000,6000,A
15,104,David Brown,Sales,2022-05-30,106,70000,7000,A

# Join func()

In [ ]:
#

In [57]:
df1.join(df2, how = 'outer', on = 'employee_id', lsuffix='_left', rsuffix='_right')

,employee_id,employee_id_left,name,department,hire_date,employee_id_right,base_salary,bonus,pay_grade
NaN,0,NaN,NaN,NaN,NaN,101.0,55000.0,5000.0,B
NaN,1,NaN,NaN,NaN,NaN,102.0,60000.0,4000.0,B
NaN,2,NaN,NaN,NaN,NaN,105.0,65000.0,6000.0,A
NaN,3,NaN,NaN,NaN,NaN,106.0,70000.0,7000.0,A
0.0,101,101.0,Alice Smith,Sales,2020-03-15,NaN,NaN,NaN,NaN
1.0,102,102.0,Bob Johnson,HR,2019-07-22,NaN,NaN,NaN,NaN
2.0,103,103.0,Carol White,IT,2021-01-10,NaN,NaN,NaN,NaN
3.0,104,104.0,David Brown,Sales,2022-05-30,NaN,NaN,NaN,NaN

In [60]:
 #to set the index right and Join correctly
#set the index the pri & foreign key values

In [65]:
df3 = df1.set_index('employee_id').join(df2.set_index('employee_id'), how='outer', on='employee_id', lsuffix='_left', rsuffix='_right' )
df3

,employee_id,name,department,hire_date,base_salary,bonus,pay_grade
101.0,101,Alice Smith,Sales,2020-03-15,55000.0,5000.0,B
102.0,102,Bob Johnson,HR,2019-07-22,60000.0,4000.0,B
103.0,103,Carol White,IT,2021-01-10,NaN,NaN,NaN
104.0,104,David Brown,Sales,2022-05-30,NaN,NaN,NaN
NaN,105,NaN,NaN,NaN,65000.0,6000.0,A
NaN,106,NaN,NaN,NaN,70000.0,7000.0,A

In [66]:
#inner join
df1.set_index('employee_id').join(df2.set_index('employee_id'), how='inner', on='employee_id', lsuffix='_left', rsuffix='_right' )

                    name department   hire_date  base_salary  bonus pay_grade
employee_id
101          Alice Smith      Sales  2020-03-15        55000   5000         B
102          Bob Johnson         HR  2019-07-22        60000   4000         B

# concatenate func()

In [ ]:
#to concate means to add to set dataframes vertically

In [68]:
pd.concat([df1, df2])

,employee_id,name,department,hire_date,base_salary,bonus,pay_grade
0,101,Alice Smith,Sales,2020-03-15,NaN,NaN,NaN
1,102,Bob Johnson,HR,2019-07-22,NaN,NaN,NaN
2,103,Carol White,IT,2021-01-10,NaN,NaN,NaN
3,104,David Brown,Sales,2022-05-30,NaN,NaN,NaN
0,101,NaN,NaN,NaN,55000.0,5000.0,B
1,102,NaN,NaN,NaN,60000.0,4000.0,B
2,105,NaN,NaN,NaN,65000.0,6000.0,A
3,106,NaN,NaN,NaN,70000.0,7000.0,A

In [ ]:
#to concate vertically, exe with axis

In [75]:
pd.concat([df1, df2], join='outer', axis=1)

,employee_id,name,department,hire_date,employee_id,base_salary,bonus,pay_grade
0,101,Alice Smith,Sales,2020-03-15,101,55000,5000,B
1,102,Bob Johnson,HR,2019-07-22,102,60000,4000,B
2,103,Carol White,IT,2021-01-10,105,65000,6000,A
3,104,David Brown,Sales,2022-05-30,106,70000,7000,A

In [ ]:
#using append
#used to append rows from one dataframe to the end of another df and return